AccumulationRegisters/ИА_СредстваВРезервеНаФондах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_СредстваВРезервеНаФондах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ИА_СредстваНаФондах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_СредстваНаФондах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСУ_ОперацииПоФондам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПояснениеТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПояснениеСсылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonForms/ИА_ПодборСтатейЗатратИПодразделений/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборПоОрганизации = Константы.ИА_ФП_ВестиФППоОрганизациям.Получить();
	ИспПодр = константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	
	Элементы.ДеревоФондовПодразделение.Видимость = ИспПодр;
	Элементы.ИА_ФондыПодразделение.Видимость = ИспПодр;

	Если Параметры <> Неопределено Тогда
		ЭтоТолстыйКлиент	= Параметры.ЭтоТолстыйКлиент;
		ДатаДок	= Параметры.ДатаДок;
		Если ДатаДок = дата(1,1,1) тогда
			ДатаДок = ТекущаяДата();
		КонецЕсли;
		Если ЭтоТолстыйКлиент Тогда
			ИА_Фонды.Загрузить(Параметры.ИА_Фонды);
		Иначе
			АдресХранилища = Параметры.АдресХранилища;  
			Попытка
				ТЗ = ПолучитьИзВременногоХранилища(АдресХранилища);
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "ОШИБКА: " + ОписаниеОшибки();
				Сообщение.УстановитьДанные(ЭтаФорма); Сообщение.Сообщить(); 
				Отказ = Истина;  Возврат;
			КонецПопытки; 
			ИА_Фонды.Загрузить(ТЗ);
		КонецЕсли; 	
		Если ОтборПоОрганизации Тогда 
			Организация = Параметры.Организация; 
		КонецЕсли; 
		ПолучитьФонды(Параметры); 
	КонецЕсли; 	
	
КонецПроцедуры
 
&НаСервере
Процедура ПолучитьФонды(ПараметрыФ)
	
	МассивОрганизаций = ИА_ФП.ПолучитьСписокОрганизацийГК(Организация);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ИА_Фонды.Подразделение КАК Подразделение,
		|	ИА_Фонды.Фонд КАК Фонд
		|ПОМЕСТИТЬ ВТ_Выбор
		|ИЗ
		|	&ИА_Фонды КАК ИА_Фонды
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Фонд,
		|	Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИА_СредстваВРезервеНаФондахОстатки.Организация КАК Организация,
		|	ИА_СредстваВРезервеНаФондахОстатки.Подразделение КАК Подразделение,
		|	ИА_СредстваВРезервеНаФондахОстатки.Фонд КАК Фонд,
		|	СУММА(ИА_СредстваВРезервеНаФондахОстатки.СуммаНалОстаток) КАК СуммаНалОстаток,
		|	СУММА(ИА_СредстваВРезервеНаФондахОстатки.СуммаБезналОстаток) КАК СуммаБезналОстаток
		|ПОМЕСТИТЬ ВТ_ФондыРезерв
		|ИЗ
		|	РегистрНакопления.ИА_СредстваВРезервеНаФондах.Остатки(&ДатаДок
		|			,
		|			ВЫБОР
		|				КОГДА &ОтборПоОрганизации = ИСТИНА
		|					ТОГДА Организация В(&Организация)
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ) КАК ИА_СредстваВРезервеНаФондахОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ИА_СредстваВРезервеНаФондахОстатки.Фонд,
		|	ИА_СредстваВРезервеНаФондахОстатки.Организация,
		|	ИА_СредстваВРезервеНаФондахОстатки.Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Фонды.Подразделение КАК Подразделение,
		|	Фонды.Фонд КАК Фонд,
		|	СУММА(ЕСТЬNULL(Фонды.СуммаБезналОстаток, 0) - ЕСТЬNULL(ВТ_ФондыРезерв.СуммаБезналОстаток, 0)) КАК СуммаБезнал,
		|	СУММА(ЕСТЬNULL(ВТ_ФондыРезерв.СуммаБезналОстаток, 0)) КАК Резерв,
		|	СУММА(ЕСТЬNULL(Фонды.СуммаНалОстаток, 0) - ЕСТЬNULL(ВТ_ФондыРезерв.СуммаНалОстаток, 0)) КАК СуммаНал,
		|	СУММА(ЕСТЬNULL(Фонды.СуммаБезналОстаток, 0)) КАК СуммаФонда
		|ПОМЕСТИТЬ ВТ_Фонды
		|ИЗ
		|	РегистрНакопления.ИА_СредстваНаФондах.Остатки(&ДатаДок
		|			,
		|			ВЫБОР
		|				КОГДА &ОтборПоОрганизации = ИСТИНА
		|					ТОГДА Организация В(&Организация)
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ) КАК Фонды
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФондыРезерв КАК ВТ_ФондыРезерв
		|		ПО Фонды.Подразделение = ВТ_ФондыРезерв.Подразделение
		|			И Фонды.Фонд = ВТ_ФондыРезерв.Фонд
		|			И Фонды.Организация = ВТ_ФондыРезерв.Организация
		|ГДЕ
		|	(Фонды.Фонд.Защищенный = ложь
		|			ИЛИ &ЭтоРСФ)
		|
		|СГРУППИРОВАТЬ ПО
		|	Фонды.Подразделение,
		|	Фонды.Фонд
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Подразделение,
		|	Фонд
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Фонды.Подразделение,
		|	ВТ_Фонды.Фонд,
		|	ВТ_Фонды.СуммаБезнал,
		|	ВТ_Фонды.Резерв,
		|	ВТ_Фонды.СуммаНал,
		|	ВТ_Фонды.СуммаФонда КАК ВсегоНаФонде,
		|	ВТ_Фонды.СуммаБезнал КАК Сумма
		|ИЗ
		|	ВТ_Фонды КАК ВТ_Фонды
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Выбор КАК ВТ_Выбор
		|		ПО ВТ_Фонды.Подразделение = ВТ_Выбор.Подразделение
		|			И ВТ_Фонды.Фонд = ВТ_Выбор.Фонд
		|ГДЕ
		|	ВТ_Фонды.СуммаБезнал > 0
		|	И ВТ_Выбор.Подразделение ЕСТЬ NULL ";	
	Запрос.УстановитьПараметр("Организация", МассивОрганизаций);
	Запрос.УстановитьПараметр("ИА_Фонды", ИА_Фонды.Выгрузить());	
	Запрос.УстановитьПараметр("ОтборПоОрганизации", ОтборПоОрганизации);
	Запрос.УстановитьПараметр("ЭтоРСФ",ИА_ФП.ЭтоРСФ());
	Запрос.УстановитьПараметр("ДатаДок",ДатаДок-1);
	Результат = Запрос.Выполнить();	
	ТаблицаФондов.Очистить();
	Если НЕ Результат.Пустой() Тогда 
		ТаблицаФондов.Загрузить(Результат.Выгрузить());
	КонецЕсли; 
	
	Если ПараметрыФ.ВалютаДок <> Неопределено и ПараметрыФ.ВалютаУпр <> Неопределено и ПараметрыФ.ВалютаДок <> ПараметрыФ.ВалютаУпр Тогда
		СтрокаКурсыВалют = ИА_ФП.ПолучитьКурсКратностьВалют(ДатаДок,ПараметрыФ.ВалютаУПР, ПараметрыФ.ВалютаДок);
		для каждого стр из ТаблицаФондов Цикл
			стр.Сумма = иа_ФП.ПересчитатьИзВалютыВВалюту1(стр.Сумма, ПараметрыФ.ВалютаУПР, ПараметрыФ.ВалютаДок,  СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КратностьУпрУчета, СтрокаКурсыВалют.КратностьДокумента);					
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

 
&НаСервере
Процедура ТаблицаФондовВыборНаСервере(Фирма,Подразделение,Фонд)
	ТЗ    = ТаблицаФондов.Выгрузить();
	Отбор = Новый Структура; 
	Отбор.Вставить("Организация",     Фирма);
	Отбор.Вставить("Фонд",            Фонд);
	Отбор.Вставить("Подразделение" ,  Подразделение);
	НайденныеСтроки = ТЗ.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 Тогда
		СтрВыбора = НайденныеСтроки[0]; 
		Стр = ИА_Фонды.Добавить();  
		ЗаполнитьЗначенияСвойств(Стр,СтрВыбора); 
		Стр.Остаток = СтрВыбора.Сумма;
		ТЗ.Удалить(СтрВыбора); 
		ТаблицаФондов.Загрузить(ТЗ); 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПеренестиВДокументНаСервере()
	Парам = Новый Структура; Парам.Очистить();
	Парам.Вставить("АдресХранилища",   АдресХранилища);
	Парам.Вставить("ЭтоФонды",         Истина); 
	ТЗ    = ИА_Фонды.Выгрузить().Скопировать();
	Если ЭтоТолстыйКлиент Тогда
		Парам.Вставить("ИА_Фонды", Новый ТаблицаЗначений);
		Парам.ИА_Фонды = ТЗ; 
	Иначе
		АдресХранилища = ПоместитьВоВременноеХранилище(ТЗ, ЭтаФорма.УникальныйИдентификатор); 
		Парам.Вставить("АдресХранилища",   АдресХранилища);
	КонецЕсли;
	Возврат Парам;
КонецФункции

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Парам = ПеренестиВДокументНаСервере();
	ЭтаФорма.ВладелецФормы.ОбработкаПодбораЗаказовФондов(Парам); 
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФондовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    Данные = Элементы.ТаблицаФондов.ТекущиеДанные;
	ТаблицаФондовВыборНаСервере(Данные.Организация, Данные.Подразделение , Данные.Фонд);
КонецПроцедуры

&НаКлиенте
Процедура ИА_ФондыСуммаПриИзменении(Элемент)
	тд = Элементы.ИА_Фонды.ТекущиеДанные;
	
	если тд.Сумма > тд.Остаток тогда
		Сообщить("Сумма к оплате превышает свободный остаток!");
		тд.Сумма = тд.Остаток;		
	КонецЕсли;
КонецПроцедуры
